tap "hashicorp/tap"
tap "jmalloc/grit"

brew "adr-tools"
brew "asdf"
brew "awscli"
brew "clang-format" # needed for VSCode protobuf extension to support formatting
brew "colordiff"
brew "diff-so-fancy"
brew "direnv"
brew "evans"
brew "gh"
brew "git"
brew "go"
brew "grpc-swift"
brew "hashicorp/tap/terraform"
brew "helm"
brew "jmalloc/grit/grit"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "mob"
brew "node"
brew "vale"
brew "watch"
brew "wdiff"
brew "wifi-password"
brew "z"
brew "zsh"

cask "1password-cli"
cask "1password"
cask "around"
cask "calibre"
cask "docker"
cask "figma"
cask "firefox@developer-edition", args: {language: "en-GB"}
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "guitar-pro"
cask "iterm2"
cask "keyboardcleantool"
cask "messenger"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"

mas "MusicHarbor", id: 1440405750
mas "Pixelmator Pro", id: 1289583905
mas "TestFlight", id: 899247664
