tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jmalloc/grit"
tap "ktr0731/evans"
tap "remotemobprogramming/brew"

brew "adr-tools"
brew "awscli"
brew "clang-format" # needed for VSCode protobuf extension to support formatting
brew "colordiff"
brew "corepack"
brew "git"
brew "go"
brew "helm"
brew "jmalloc/grit/grit"
brew "jq"
brew "ktr0731/evans/evans"
brew "kubectx"
brew "kubernetes-cli"
brew "remotemobprogramming/brew/mob"
brew "node"
brew "node@20", link: false
brew "podman"
brew "hashicorp/tap/terraform"
brew "vale"
brew "watch"
brew "wdiff"
brew "wifi-password"
brew "z"
brew "zsh"

cask "1password-cli"
cask "1password"
cask "around"
cask "authy"
cask "calibre"
cask "figma"
cask "firefox-developer-edition", args: {language: "en-GB"}
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "guitar-pro"
cask "iterm2"
cask "keyboardcleantool"
cask "messenger"
cask "podman-desktop"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "MusicHarbor", id: 1440405750
mas "TestFlight", id: 899247664
