tap "datawire/blackbird"
tap "ezzatron/brew-php"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jmalloc/grit"
tap "ktr0731/evans"

brew "awscli"
brew "clang-format" # needed for VSCode protobuf extension to support formatting
brew "colordiff"
brew "composer"
brew "datawire/blackbird/telepresence-arm64" unless system "[[ \"$(uname -m)\" != arm64 ]]"
brew "datawire/blackbird/telepresence" unless system "[[ \"$(uname -m)\" == arm64 ]]"
brew "ezzatron/brew-php/brew-php"
brew "git"
brew "go"
brew "helm"
brew "jmalloc/grit/grit"
brew "jq"
brew "ktr0731/evans/evans"
brew "kubectx"
brew "kubernetes-cli", link: false
brew "kubernetes-cli@1.22"
brew "node"
brew "node@16", link: false
brew "php"
brew "watch"
brew "wdiff"
brew "wifi-password"
brew "yarn"
brew "z"
brew "zsh"

cask "1password-cli"
cask "1password"
cask "around"
cask "authy"
cask "calibre"
cask "docker"
cask "firefox-developer-edition", args: {language: "en-GB"}
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "guitar-pro"
cask "iterm2"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
